function RemoveDis(Id){
	Id.style.textShadow="0 0 0px #000";
	Id.style.transition="0.3s";
	Id.style.transform="scale(1)";
	//Id.style.paddingLeft="5px";
	//Id.style.paddingRight="5px";
	Id.style.padding="5px";
}
function WriteDis(Id){
	Id.style.textShadow="0 0 4px #000";
	Id.style.backgroundColor="white";
	//Id.style.padding="10px";
	Id.style.transform="scale(1.4)";
	Id.style.transition="0.3s";
	Id.style.color="black";
	Id.style.filter="none";
}
var Name=["تأسيس هيأة الأمم المتحدة",
"الخط الأحمر بين موسكو و واشنطن",
"مشروع مارشال",
"قمة حركة عدم الانحياز في الجزائر",
"تأسيس الكومنفورم",
"حل الكوميكون",
"قنبلة الو.م.أ في هيروشيما",
"زوال الاتحاد السوفييتي",
"قنبلة الو.م.أ في ناكازاكي",
"تصفية حلف وارسو",
"مؤتمر يالطا",
"مؤتمر باندونغ",
"مؤتمر بوتسدام",
"اتفاقية بروتن وودز",
"المصادقة على ميثاق الأمم المتحدة",
"مشروع ايزنهاور",
"إنشاء الكوميكون",
"زيارة نيكسون لموسكو",
"تأسيس حلف الناتو",
"زيارة برجنيف للو.م.أ",
"تأسيس حلف جنوب شرق آسيا",
"اتفاقية هلسنكي",
"تأسيس حلف بغداد",
"استقلال سوريا و لبنان",
"تأسيس حلف وارسو",
"استقلال الهند , بنغلادش و باكستان",
"مبدأ ترومان",
"استقلال إندونيسيا",
"قيام جمهورية ألمانيا الغربية",
"مبدأ جدانوف",
"قيام ألمانيا الشرقية",
"وصول غورباتشوف للسلطة",
"إقامة جدار برلين",
"تفجير أول قنبلة سوفييتية في سيبيريا",
"اتفاقية سالت 1",
"انتصار الثورة الشيوعية في الصين",
"اتفاقية سالت 2",
"وفاة ستالين و الدعوة للتعايش السلمي",
"تهديم جدار برلين",
"إطلاق سبوتنك أول قمر صناعي سوفييتي",
"توحيد الألمانيتين",
"تدخل الاتحاد السوفييتي في أفغانستان",
"قمة مالطا",
"مشروع حرب النجوم",
"خروج فرنسا من حلف الناتو",
"غاغارين يدور حول الأرض",
"حل مكتب الكومنفورم",
"مؤتمر التعاون الاقتصادي الدولي",
"تأسيس جامعة الدول العربية",
"وصول أرمسترونغ لسطح القمر",
"قيام الو.م.أ بإنشاء جسر جوي لفك الحصار على برلين",
"حصار الاتحاد السوفييتي لبرلين الغربية",
"اندلاع الحرب الأهلية بين الكوريتين",
"انتهاء الحرب الأهلية الكورية",
"تأسيس حركة عدم الانحياز",
"هيمنة الاتحاد السوفييتي على القسم الشمالي لكوريا",
"الإعلان عن قيام الجمهورية الدمقراطية الكورية"
];
 var date=["1945/10/24",
"1963/06/20",
"1947/06/05",
"من 05/09/1973 إلى 09/09/1973",
"1947/10/06",
"1991/06/28",
"1945/08/06",
"1991/12/25",
"1945/08/09",
"1991/07/01",
"1945/02/04",
"من 18/04/1955 إلى 24/04/1955",
"1945/08/02",
"1944",
"1945/06/26",
"1957/01/05",
"1949/01/25",
"ماي 1972",
"1949/04/04",
"1973",
"1954/09/08",
"1975",
"1955/02/24",
"1946",
"1955/05/14",
"1947",
"1947/03/12",
"1949",
"1949/05/08",
"1947/09/22",
"1949/10/07",
"مارس 1985",
"1961/08/13",
"1949/09/21",
"1972/05/26",
"1949/10/01",
"جانفي 1979",
"1953/03/05",
"1989/11/09",
"1957/10/04",
"1990/10/03",
"1979",
"03/12/1989 و 04/12/1989",
"مارس 1983",
"1966",
"1961/04/21",
"1956/04/17",
"ديسمبر 1975",
"1945/03/22",
"1969",
"من 28/06/1948 إلى 12/05/1949",
"23/06/1948",
"1950/06/25",
"1953/07/27",
"من 01/09/1961 إلى 06/09/1961",
"1948/08/25",
"1948/09/09"
 ];
var number;
function Generate(){
	number=Math.floor(Math.random()*57) + 1 ;
	document.getElementById("DateOfThing").innerHTML = date[number];
	document.getElementById("TheThing").innerHTML = "؟";

}
function ShowHidden(){
	document.getElementById("TheThing").innerHTML = Name[number];
}
